{
    "metadata": {
        "total_size": 374942912
    },
    "weight_map": {
        "mask_decoder.iou_prediction_head.layers.0.bias": "model.safetensors",
        "mask_decoder.iou_prediction_head.layers.0.weight": "model.safetensors",
        "mask_decoder.iou_prediction_head.proj_in.bias": "model.safetensors",
        "mask_decoder.iou_prediction_head.proj_in.weight": "model.safetensors",
        "mask_decoder.iou_prediction_head.proj_out.bias": "model.safetensors",
        "mask_decoder.iou_prediction_head.proj_out.weight": "model.safetensors",
        "mask_decoder.iou_token.weight": "model.safetensors",
        "mask_decoder.mask_tokens.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.0.layers.0.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.0.layers.0.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.0.proj_in.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.0.proj_in.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.0.proj_out.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.0.proj_out.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.1.layers.0.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.1.layers.0.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.1.proj_in.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.1.proj_in.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.1.proj_out.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.1.proj_out.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.2.layers.0.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.2.layers.0.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.2.proj_in.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.2.proj_in.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.2.proj_out.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.2.proj_out.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.3.layers.0.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.3.layers.0.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.3.proj_in.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.3.proj_in.weight": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.3.proj_out.bias": "model.safetensors",
        "mask_decoder.output_hypernetworks_mlps.3.proj_out.weight": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.final_attn_token_to_image.v_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layer_norm_final_attn.bias": "model.safetensors",
        "mask_decoder.transformer.layer_norm_final_attn.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_image_to_token.v_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.cross_attn_token_to_image.v_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm1.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm1.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm2.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm2.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm3.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm3.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm4.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.layer_norm4.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.mlp.lin1.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.mlp.lin1.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.mlp.lin2.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.mlp.lin2.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.0.self_attn.v_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_image_to_token.v_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.cross_attn_token_to_image.v_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm1.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm1.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm2.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm2.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm3.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm3.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm4.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.layer_norm4.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.mlp.lin1.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.mlp.lin1.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.mlp.lin2.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.mlp.lin2.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.k_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.k_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.out_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.out_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.q_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.q_proj.weight": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.v_proj.bias": "model.safetensors",
        "mask_decoder.transformer.layers.1.self_attn.v_proj.weight": "model.safetensors",
        "mask_decoder.upscale_conv1.bias": "model.safetensors",
        "mask_decoder.upscale_conv1.weight": "model.safetensors",
        "mask_decoder.upscale_conv2.bias": "model.safetensors",
        "mask_decoder.upscale_conv2.weight": "model.safetensors",
        "mask_decoder.upscale_layer_norm.bias": "model.safetensors",
        "mask_decoder.upscale_layer_norm.weight": "model.safetensors",
        "prompt_encoder.mask_embed.conv1.bias": "model.safetensors",
        "prompt_encoder.mask_embed.conv1.weight": "model.safetensors",
        "prompt_encoder.mask_embed.conv2.bias": "model.safetensors",
        "prompt_encoder.mask_embed.conv2.weight": "model.safetensors",
        "prompt_encoder.mask_embed.conv3.bias": "model.safetensors",
        "prompt_encoder.mask_embed.conv3.weight": "model.safetensors",
        "prompt_encoder.mask_embed.layer_norm1.bias": "model.safetensors",
        "prompt_encoder.mask_embed.layer_norm1.weight": "model.safetensors",
        "prompt_encoder.mask_embed.layer_norm2.bias": "model.safetensors",
        "prompt_encoder.mask_embed.layer_norm2.weight": "model.safetensors",
        "prompt_encoder.no_mask_embed.weight": "model.safetensors",
        "prompt_encoder.not_a_point_embed.weight": "model.safetensors",
        "prompt_encoder.point_embed.0.weight": "model.safetensors",
        "prompt_encoder.point_embed.1.weight": "model.safetensors",
        "prompt_encoder.point_embed.2.weight": "model.safetensors",
        "prompt_encoder.point_embed.3.weight": "model.safetensors",
        "shared_image_embedding.positional_embedding": "model.safetensors",
        "vision_encoder.layers.0.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.0.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.0.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.0.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.0.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.0.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.0.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.0.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.0.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.0.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.0.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.0.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.0.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.0.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.1.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.1.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.1.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.1.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.1.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.1.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.1.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.1.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.1.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.1.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.1.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.1.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.1.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.1.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.10.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.10.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.10.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.10.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.10.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.10.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.10.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.10.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.10.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.10.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.10.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.10.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.10.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.10.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.11.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.11.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.11.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.11.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.11.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.11.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.11.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.11.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.11.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.11.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.11.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.11.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.11.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.11.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.2.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.2.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.2.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.2.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.2.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.2.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.2.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.2.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.2.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.2.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.2.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.2.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.2.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.2.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.3.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.3.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.3.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.3.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.3.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.3.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.3.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.3.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.3.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.3.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.3.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.3.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.3.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.3.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.4.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.4.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.4.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.4.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.4.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.4.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.4.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.4.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.4.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.4.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.4.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.4.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.4.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.4.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.5.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.5.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.5.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.5.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.5.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.5.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.5.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.5.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.5.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.5.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.5.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.5.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.5.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.5.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.6.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.6.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.6.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.6.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.6.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.6.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.6.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.6.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.6.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.6.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.6.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.6.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.6.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.6.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.7.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.7.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.7.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.7.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.7.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.7.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.7.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.7.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.7.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.7.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.7.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.7.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.7.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.7.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.8.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.8.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.8.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.8.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.8.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.8.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.8.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.8.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.8.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.8.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.8.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.8.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.8.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.8.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.layers.9.attn.proj.bias": "model.safetensors",
        "vision_encoder.layers.9.attn.proj.weight": "model.safetensors",
        "vision_encoder.layers.9.attn.qkv.bias": "model.safetensors",
        "vision_encoder.layers.9.attn.qkv.weight": "model.safetensors",
        "vision_encoder.layers.9.attn.rel_pos_h": "model.safetensors",
        "vision_encoder.layers.9.attn.rel_pos_w": "model.safetensors",
        "vision_encoder.layers.9.layer_norm1.bias": "model.safetensors",
        "vision_encoder.layers.9.layer_norm1.weight": "model.safetensors",
        "vision_encoder.layers.9.layer_norm2.bias": "model.safetensors",
        "vision_encoder.layers.9.layer_norm2.weight": "model.safetensors",
        "vision_encoder.layers.9.mlp.lin1.bias": "model.safetensors",
        "vision_encoder.layers.9.mlp.lin1.weight": "model.safetensors",
        "vision_encoder.layers.9.mlp.lin2.bias": "model.safetensors",
        "vision_encoder.layers.9.mlp.lin2.weight": "model.safetensors",
        "vision_encoder.neck.conv1.weight": "model.safetensors",
        "vision_encoder.neck.conv2.weight": "model.safetensors",
        "vision_encoder.neck.layer_norm1.bias": "model.safetensors",
        "vision_encoder.neck.layer_norm1.weight": "model.safetensors",
        "vision_encoder.neck.layer_norm2.bias": "model.safetensors",
        "vision_encoder.neck.layer_norm2.weight": "model.safetensors",
        "vision_encoder.patch_embed.projection.bias": "model.safetensors",
        "vision_encoder.patch_embed.projection.weight": "model.safetensors",
        "vision_encoder.pos_embed": "model.safetensors"
    }
}